db-assets/output/jmx/server-file-heavy_withconfidential.jmx
<?xml version='1.0' encoding='UTF-8'?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3"><hashTree><TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Server File Heavy With Confidential Load Test" enabled="true"><stringProp name="TestPlan.comments" /><boolProp name="TestPlan.functional_mode">false</boolProp><boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp><boolProp name="TestPlan.serialize_threadgroups">false</boolProp><elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true"><collectionProp name="Arguments.arguments" /></elementProp><stringProp name="TestPlan.user_define_classpath" /></TestPlan><hashTree><Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true"><collectionProp name="Arguments.arguments"><elementProp name="THREAD_COUNT" elementType="Argument"><stringProp name="Argument.name">THREAD_COUNT</stringProp><stringProp name="Argument.value">${__P(threads,10)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp><elementProp name="RAMP_UP_SEC" elementType="Argument"><stringProp name="Argument.name">RAMP_UP_SEC</stringProp><stringProp name="Argument.value">${__P(rampup,60)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp><elementProp name="DURATION_SEC" elementType="Argument"><stringProp name="Argument.name">DURATION_SEC</stringProp><stringProp name="Argument.value">${__P(duration,3600)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp><elementProp name="TARGET_HOST" elementType="Argument"><stringProp name="Argument.name">TARGET_HOST</stringProp><stringProp name="Argument.value">${__P(host,localhost)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp><elementProp name="TARGET_PORT" elementType="Argument"><stringProp name="Argument.name">TARGET_PORT</stringProp><stringProp name="Argument.value">${__P(port,8080)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp><elementProp name="CONFIDENTIAL_PERCENT" elementType="Argument"><stringProp name="Argument.name">CONFIDENTIAL_PERCENT</stringProp><stringProp name="Argument.value">${__P(conf_pct,10)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp><elementProp name="ZIP_PERCENT" elementType="Argument"><stringProp name="Argument.name">ZIP_PERCENT</stringProp><stringProp name="Argument.value">${__P(zip_pct,20)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp></collectionProp></Arguments><hashTree /><ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true"><elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true"><collectionProp name="Arguments.arguments" /></elementProp><stringProp name="HTTPSampler.domain">${TARGET_HOST}</stringProp><stringProp name="HTTPSampler.port">${TARGET_PORT}</stringProp><stringProp name="HTTPSampler.protocol">http</stringProp><stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp><stringProp name="HTTPSampler.path" /><stringProp name="HTTPSampler.concurrentPool">6</stringProp><stringProp name="HTTPSampler.connect_timeout" /><stringProp name="HTTPSampler.response_timeout" /></ConfigTestElement><hashTree /><HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true"><collectionProp name="HeaderManager.headers"><elementProp name="" elementType="Header"><stringProp name="Header.name">Content-Type</stringProp><stringProp name="Header.value">application/json</stringProp></elementProp></collectionProp></HeaderManager><hashTree /><ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Load Test Threads" enabled="true"><stringProp name="ThreadGroup.on_sample_error">continue</stringProp><elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true"><boolProp name="LoopController.continue_forever">false</boolProp><stringProp name="LoopController.loops">-1</stringProp></elementProp><stringProp name="ThreadGroup.num_threads">${THREAD_COUNT}</stringProp><stringProp name="ThreadGroup.ramp_time">${RAMP_UP_SEC}</stringProp><boolProp name="ThreadGroup.scheduler">true</boolProp><stringProp name="ThreadGroup.duration">${DURATION_SEC}</stringProp><stringProp name="ThreadGroup.delay" /><boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp></ThreadGroup><hashTree><ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="CPU Load (35%)" enabled="true"><intProp name="ThroughputController.style">1</intProp><boolProp name="ThroughputController.perThread">true</boolProp><intProp name="ThroughputController.maxThroughput">1</intProp><stringProp name="ThroughputController.percentThroughput">35.0</stringProp></ThroughputController><hashTree><HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="CPU Operation" enabled="true"><elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true"><collectionProp name="Arguments.arguments"><elementProp name="" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">false</boolProp><stringProp name="Argument.value">{"duration_ms": 100, "intensity": 0.7}</stringProp><stringProp name="Argument.metadata">=</stringProp><boolProp name="HTTPArgument.use_equals">true</boolProp><stringProp name="Argument.name" /></elementProp></collectionProp></elementProp><stringProp name="HTTPSampler.domain" /><stringProp name="HTTPSampler.port" /><stringProp name="HTTPSampler.protocol" /><stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp><stringProp name="HTTPSampler.path">/api/v1/operations/cpu</stringProp><stringProp name="HTTPSampler.method">POST</stringProp><boolProp name="HTTPSampler.follow_redirects">true</boolProp><boolProp name="HTTPSampler.auto_redirects">false</boolProp><boolProp name="HTTPSampler.use_keepalive">true</boolProp><boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp><stringProp name="HTTPSampler.embedded_url_re" /><stringProp name="HTTPSampler.connect_timeout" /><stringProp name="HTTPSampler.response_timeout" /><boolProp name="HTTPSampler.postBodyRaw">true</boolProp></HTTPSamplerProxy><hashTree /></hashTree><ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="Memory Load (34%)" enabled="true"><intProp name="ThroughputController.style">1</intProp><boolProp name="ThroughputController.perThread">true</boolProp><intProp name="ThroughputController.maxThroughput">1</intProp><stringProp name="ThroughputController.percentThroughput">34.0</stringProp></ThroughputController><hashTree><HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Memory Operation" enabled="true"><elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true"><collectionProp name="Arguments.arguments"><elementProp name="" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">false</boolProp><stringProp name="Argument.value">{"duration_ms": 100, "size_mb": 10, "pattern": "random"}</stringProp><stringProp name="Argument.metadata">=</stringProp><boolProp name="HTTPArgument.use_equals">true</boolProp><stringProp name="Argument.name" /></elementProp></collectionProp></elementProp><stringProp name="HTTPSampler.domain" /><stringProp name="HTTPSampler.port" /><stringProp name="HTTPSampler.protocol" /><stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp><stringProp name="HTTPSampler.path">/api/v1/operations/mem</stringProp><stringProp name="HTTPSampler.method">POST</stringProp><boolProp name="HTTPSampler.follow_redirects">true</boolProp><boolProp name="HTTPSampler.auto_redirects">false</boolProp><boolProp name="HTTPSampler.use_keepalive">true</boolProp><boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp><stringProp name="HTTPSampler.embedded_url_re" /><stringProp name="HTTPSampler.connect_timeout" /><stringProp name="HTTPSampler.response_timeout" /><boolProp name="HTTPSampler.postBodyRaw">true</boolProp></HTTPSamplerProxy><hashTree /></hashTree><ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="File Operations (30%)" enabled="true"><intProp name="ThroughputController.style">1</intProp><boolProp name="ThroughputController.perThread">true</boolProp><intProp name="ThroughputController.maxThroughput">1</intProp><stringProp name="ThroughputController.percentThroughput">30.0</stringProp></ThroughputController><hashTree><JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Determine File Parameters" enabled="true"><stringProp name="scriptLanguage">groovy</stringProp><stringProp name="parameters" /><stringProp name="filename" /><stringProp name="cacheKey">true</stringProp><stringProp name="script">
// Determine is_confidential and make_zip based on percentages
def confPercent = Integer.parseInt(vars.get("CONFIDENTIAL_PERCENT") ?: "0")
def zipPercent = Integer.parseInt(vars.get("ZIP_PERCENT") ?: "20")

def random = new Random()
def confRoll = random.nextInt(100) + 1
def zipRoll = random.nextInt(100) + 1

vars.put("is_confidential", confRoll &lt;= confPercent ? "true" : "false")
vars.put("make_zip", zipRoll &lt;= zipPercent ? "true" : "false")
</stringProp></JSR223PreProcessor><hashTree /><HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="File Operation" enabled="true"><elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true"><collectionProp name="Arguments.arguments"><elementProp name="" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">false</boolProp><stringProp name="Argument.value">{"is_confidential": ${is_confidential}, "make_zip": ${make_zip}}</stringProp><stringProp name="Argument.metadata">=</stringProp><boolProp name="HTTPArgument.use_equals">true</boolProp><stringProp name="Argument.name" /></elementProp></collectionProp></elementProp><stringProp name="HTTPSampler.domain" /><stringProp name="HTTPSampler.port" /><stringProp name="HTTPSampler.protocol" /><stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp><stringProp name="HTTPSampler.path">/api/v1/operations/file</stringProp><stringProp name="HTTPSampler.method">POST</stringProp><boolProp name="HTTPSampler.follow_redirects">true</boolProp><boolProp name="HTTPSampler.auto_redirects">false</boolProp><boolProp name="HTTPSampler.use_keepalive">true</boolProp><boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp><stringProp name="HTTPSampler.embedded_url_re" /><stringProp name="HTTPSampler.connect_timeout" /><stringProp name="HTTPSampler.response_timeout" /><boolProp name="HTTPSampler.postBodyRaw">true</boolProp></HTTPSamplerProxy><hashTree /></hashTree><ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="Anomaly (1%)" enabled="true"><intProp name="ThroughputController.style">1</intProp><boolProp name="ThroughputController.perThread">true</boolProp><intProp name="ThroughputController.maxThroughput">1</intProp><stringProp name="ThroughputController.percentThroughput">1.0</stringProp></ThroughputController><hashTree><HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Anomaly - High CPU" enabled="true"><elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true"><collectionProp name="Arguments.arguments"><elementProp name="" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">false</boolProp><stringProp name="Argument.value">{"duration_ms": 5000, "intensity": 1.0}</stringProp><stringProp name="Argument.metadata">=</stringProp><boolProp name="HTTPArgument.use_equals">true</boolProp><stringProp name="Argument.name" /></elementProp></collectionProp></elementProp><stringProp name="HTTPSampler.domain" /><stringProp name="HTTPSampler.port" /><stringProp name="HTTPSampler.protocol" /><stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp><stringProp name="HTTPSampler.path">/api/v1/operations/cpu</stringProp><stringProp name="HTTPSampler.method">POST</stringProp><boolProp name="HTTPSampler.follow_redirects">true</boolProp><boolProp name="HTTPSampler.auto_redirects">false</boolProp><boolProp name="HTTPSampler.use_keepalive">true</boolProp><boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp><stringProp name="HTTPSampler.embedded_url_re" /><stringProp name="HTTPSampler.connect_timeout" /><stringProp name="HTTPSampler.response_timeout" /><boolProp name="HTTPSampler.postBodyRaw">true</boolProp></HTTPSamplerProxy><hashTree /></hashTree></hashTree><ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="false"><boolProp name="ResultCollector.error_logging">false</boolProp><objProp><name>saveConfig</name><value class="SampleSaveConfiguration"><time>true</time><latency>true</latency><timestamp>true</timestamp><success>true</success><label>true</label><code>true</code><message>true</message><threadName>true</threadName><dataType>true</dataType><encoding>false</encoding><assertions>true</assertions><subresults>true</subresults><responseData>false</responseData><samplerData>false</samplerData><xml>false</xml><fieldNames>true</fieldNames><responseHeaders>false</responseHeaders><requestHeaders>false</requestHeaders><responseDataOnError>false</responseDataOnError><saveAssertionResultsFailureMessage>true</saveAssertionResultsFailureMessage><bytes>true</bytes><sentBytes>true</sentBytes><url>true</url><threadCounts>true</threadCounts><idleTime>true</idleTime><connectTime>true</connectTime></value></objProp><stringProp name="filename" /></ResultCollector><hashTree /><ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true"><boolProp name="ResultCollector.error_logging">false</boolProp><objProp><name>saveConfig</name><value class="SampleSaveConfiguration"><time>true</time><latency>true</latency><timestamp>true</timestamp><success>true</success><label>true</label><code>true</code><message>true</message><threadName>true</threadName><dataType>true</dataType><encoding>false</encoding><assertions>true</assertions><subresults>true</subresults><responseData>false</responseData><samplerData>false</samplerData><xml>false</xml><fieldNames>true</fieldNames><responseHeaders>false</responseHeaders><requestHeaders>false</requestHeaders><responseDataOnError>false</responseDataOnError><saveAssertionResultsFailureMessage>true</saveAssertionResultsFailureMessage><bytes>true</bytes><sentBytes>true</sentBytes><url>true</url><threadCounts>true</threadCounts><idleTime>true</idleTime><connectTime>true</connectTime></value></objProp><stringProp name="filename" /></ResultCollector><hashTree /><ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true"><boolProp name="ResultCollector.error_logging">false</boolProp><objProp><name>saveConfig</name><value class="SampleSaveConfiguration"><time>true</time><latency>true</latency><timestamp>true</timestamp><success>true</success><label>true</label><code>true</code><message>true</message><threadName>true</threadName><dataType>true</dataType><encoding>false</encoding><assertions>true</assertions><subresults>true</subresults><responseData>false</responseData><samplerData>false</samplerData><xml>false</xml><fieldNames>true</fieldNames><responseHeaders>false</responseHeaders><requestHeaders>false</requestHeaders><responseDataOnError>false</responseDataOnError><saveAssertionResultsFailureMessage>true</saveAssertionResultsFailureMessage><bytes>true</bytes><sentBytes>true</sentBytes><url>true</url><threadCounts>true</threadCounts><idleTime>true</idleTime><connectTime>true</connectTime></value></objProp><stringProp name="filename" /></ResultCollector><hashTree /></hashTree></hashTree></jmeterTestPlan>